app/controllers/spaces_controller.rb

SELECT "spaces".* FROM "spaces"
---
  def index
    @spaces = Space.all

INSERT INTO "spaces" ("user_id", "name", "description", "price_per_night", "available_from", "available_to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @space = Space.new(space_params)

    respond_to do |format|
      if @space.save

UPDATE "spaces" SET "price_per_night" = ?, "updated_at" = ? WHERE "spaces"."id" = ?  [["price_per_night", 44567.1], ["updated_at", "2018-11-16 08:26:41.360321"], ["id", 2]]
---
  def update
    # check that owner is the same as the user e.g is_user?(@space.user)
    respond_to do |format|
      if @space.update(space_params)

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_space
    @space = Space.find(params[:id])